# System shape — edit freely. `brew bundle --file=Brewfile` installs anything missing.
# Seeded from the 2026 personal machine, curated (the decade of postgres 12/13/14,
# rbenv, python 3.9+3.10, etc. was intentionally left behind).

# Take over apps that were installed manually instead of erroring on them
cask_args adopt: true

# --- Shell & CLI ---
brew "zsh"
brew "autojump"
brew "gh"
brew "git-delta"
brew "mise"
brew "ripgrep"
brew "jq"
brew "sd"
brew "fd"

# --- Dev ---
brew "awscli"
brew "yarn"

# --- Apps ---
cask "ghostty"
cask "sublime-text"
cask "docker-desktop"
cask "slack"
cask "1password"
cask "ngrok"

# --- Quick Look niceties ---
cask "qlmarkdown"
cask "quicklook-video"
